# Lab 4A

In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Task 1: Join/Merge three datasets together

Your task is to take three separate datasets (`grades1a.csv`, `grades1b.csv`, `grades1c.csv`) and merge them together.
You may find the [documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html) helpful as it contains some visualizations to help you understand the different merges and joins that are possible.

**Note: In your Explainer Video, remember to explain your code in detail. Explain not just what you did, but also why you did it that way.**

The final dataset should look like this:

### Sample Output

```
final_df
```

|    | Name             |   Student ID |   Chemistry |   Physics |   Math |
|---:|:-----------------|-------------:|------------:|----------:|-------:|
|  0 | Lila Oni         |        12001 |          59 |        90 |     45 |
|  1 | Amina Chimwala   |        12002 |          54 |        42 |     85 |
|  2 | Neda Makena      |        12003 |          42 |        88 |     54 |
|  3 | Shanthi Catrina  |        12004 |          66 |        48 |     64 |
|  4 | Deirbhile Bhavna |        12005 |          60 |        80 |     72 |
|  5 | Ige Aifric       |        12006 |          78 |        73 |     64 |
|  6 | Firouzeh Rudo    |        12007 |          64 |        43 |     67 |
|  7 | Desta Jahanara   |        12008 |          82 |        69 |     70 |
|  8 | Taiwo Sona       |        12009 |          63 |        54 |     80 |
|  9 | Fíona Finnguala  |        12010 |          41 |        52 |     70 |

In [17]:
# Your Answer Here
df1 = pd.read_csv('grades1a.csv')
df2 = pd.read_csv('grades1b.csv')
df3 = pd.read_csv('grades1c.csv')
final_df = pd.merge(df1,df2)
final_df

              Name  Student ID  Physics  Math  Chemistry
0         Lila Oni       12001       90    45         59
1   Amina Chimwala       12002       42    85         54
2      Neda Makena       12003       88    54         42
3  Shanthi Catrina       12004       48    64         66
4   Desta Jahanara       12008       69    70         82
5       Taiwo Sona       12009       54    80         63
6  Fíona Finnguala       12010       52    70         41

## Task 2: Combine two datasets with different keys

Your task is to merge two datasets together on the "Student ID" column in `grades2a.csv` and the "SID" column in the file `grades2b.csv`.

You can do this any way you like that matches the Sample Output (there are multiple ways of doing it) but please explain how you did it (and why).

### Sample Output

|    | Name             |   Student ID |   Chemistry |   Physics |   Math |
|---:|:-----------------|-------------:|------------:|----------:|-------:|
|  0 | Lila Oni         |        12001 |          59 |        90 |     45 |
|  1 | Amina Chimwala   |        12002 |          54 |        42 |     85 |
|  2 | Neda Makena      |        12003 |          42 |        88 |     54 |
|  3 | Shanthi Catrina  |        12004 |          66 |        48 |     64 |
|  4 | Deirbhile Bhavna |        12005 |          60 |        80 |     72 |
|  5 | Ige Aifric       |        12006 |          78 |        73 |     64 |
|  6 | Firouzeh Rudo    |        12007 |          64 |        43 |     67 |
|  7 | Desta Jahanara   |        12008 |          82 |        69 |     70 |
|  8 | Taiwo Sona       |        12009 |          63 |        54 |     80 |
|  9 | Fíona Finnguala  |        12010 |          41 |        52 |     70 |

In [19]:
# Your Solution Here
df1 = pd.read_csv('grades2a.csv')
df2 = pd.read_csv('grades2b.csv')
final_pdf = pd.concat([df1,df2])
final_pdf

               Name  Student ID  Chemistry  Physics  Math      SID
0          Lila Oni     12001.0         59       90    45      NaN
1    Amina Chimwala     12002.0         54       42    85      NaN
2       Neda Makena     12003.0         42       88    54      NaN
3   Shanthi Catrina     12004.0         66       48    64      NaN
4  Deirbhile Bhavna     12005.0         60       80    72      NaN
5        Ige Aifric     12006.0         78       73    64      NaN
0   Shanthi Catrina         NaN         66       48    64  12004.0
1  Deirbhile Bhavna         NaN         60       80    72  12005.0
2        Ige Aifric         NaN         78       73    64  12006.0
3     Firouzeh Rudo         NaN         64       43    67  12007.0
4    Desta Jahanara         NaN         82       69    70  12008.0
5        Taiwo Sona         NaN         63       54    80  12009.0
6   Fíona Finnguala         NaN         41       52    70  12010.0

## Task 3: Merge dataframes and keep only overlapping rows

Often it is useful to try a bunch of different merge operations on a dataset to identify what parts of the data overlap, and what parts are disparate.
With the overlapping rows, you can then look at the value from the left, and the value from the right to compare them to see if there is any ambiguity if you chose to merge the dataframes.

In this question, you will use the same data as in Task 2 (`grades2a.csv` and `grades2b.csv`) and try to identify which rows are duplicates, or appear in both datasets.

**Restriction: For this Task, you CANNOT rename columns.**

## Sample Output

|    | Name_x           |   Student ID |   Chemistry_x |   Physics_x |   Math_x | Name_y           |   SID |   Chemistry_y |   Physics_y |   Math_y |
|---:|:-----------------|-------------:|--------------:|------------:|---------:|:-----------------|------:|--------------:|------------:|---------:|
|  0 | Shanthi Catrina  |        12004 |            66 |          48 |       64 | Shanthi Catrina  | 12004 |            66 |          48 |       64 |
|  1 | Deirbhile Bhavna |        12005 |            60 |          80 |       72 | Deirbhile Bhavna | 12005 |            60 |          80 |       72 |
|  2 | Ige Aifric       |        12006 |            78 |          73 |       64 | Ige Aifric       | 12006 |            78 |          73 |       64 |

In [14]:
df1 = pd.read_csv('grades2a.csv')
df2 = pd.read_csv('grades2b.csv')
final_pdf = df1.merge(df2, on=["Name"])
final_pdf

,Name,Student ID,Chemistry_x,Physics_x,Math_x,SID,Chemistry_y,Physics_y,Math_y
0,Shanthi Catrina,12004,66,48,64,12004,66,48,64
1,Deirbhile Bhavna,12005,60,80,72,12005,60,80,72
2,Ige Aifric,12006,78,73,64,12006,78,73,64

## Task 4: Explain the different merge types

### Task 4.1 - Table

The first part of this question is to fill out a table in words. For each merge type, write a sentence or two to explain each merge type. 

### Task 4.2 - Visualization

The second part of this question is to find (with citation) or create a diagram to explain the merge types visually.

In [6]:
### Task 4.1 - Table

| Merge Type | Explanation |
| ---------- | ----------- |
| Left join  | Key ids from the left side are kept and the to be merge ids are added in accoradance to the left ids. |
| Right join | Key ids from the right side are kept and the to be merge ids are added in accoradance to the right ids. |
| Outer join | In outer join, all of the values are merged together. Unfilled values are filled with Nan.|
| Inner join | In inner join, only the values under ids are kept. Rest all values are discarded.  |
| Cross join | Keys ids from the left side are kept and the remaining ids are added in a way that it creates a cartesian product|

SyntaxError: invalid syntax (<ipython-input-6-082aa2cde897>, line 3)

In [7]:
### Task 4.2 - Visualization

Find (or create/sketch) a visualization/graphic/picture that makes sense to you on the different types of join, and explain it (in words) so you can crystallize your understanding of the merge types and how they work practically.

**Note: Please clearly cite and reference any graphic with a link and some text that you choose to use from external sources.**

SyntaxError: invalid syntax (<ipython-input-7-68d838b49f74>, line 3)

In [8]:
# Your solution here
I have used Venn diagrams to understand the different types of merge that exists. These diagrams explain the concept better since
what is being merged is usualy shaded.

The picture of all the merge types is as follows refrence: (https://www.programmersought.com/article/91585362875/):
    
plt.imshow(df.Screenshot[0])
plt.show()

The first type of merge shown is left join wherein the new dataset is joined to the existing dataframe from the left side
The seconf type of merge shown is inner join wherein the common id values between the given datasets is merged togther
The third type of merge shown is right Join where in the the newer dataset is merged to the existing dataset from the right side
the last type of merge shown is fuller out join wherein all the id values from the dataset is merged and wherever there is an empty
value, it is filled with Nan.

SyntaxError: invalid syntax (<ipython-input-8-db4ce4a2adbb>, line 2)

That's it, nice work!